hakimmc/S32K344_Examples/Matlab_Softwares/CanExample/TJA1043_Loop_Example_W_Interrupt_Method/TJA1042_Loop_Example/TJA1042_Loop_Example_Config/generate/src/Adc_MBDT_PBcfg.c
/*==================================================================================================
*   Project              : RTD AUTOSAR 4.7
*   Platform             : CORTEXM
*   Peripheral           : ADC_SAR
*   Dependencies         : none
*
*   Autosar Version      : 4.7.0
*   Autosar Revision     : ASR_REL_4_7_REV_0000
*   Autosar Conf.Variant :
*   SW Version           : 5.0.0
*   Build Version        : S32K3_RTD_5_0_0_D2408_ASR_REL_4_7_REV_0000_20241002
*
*   Copyright 2020 - 2024 NXP
*
*   NXP Confidential and Proprietary. This software is owned or controlled by NXP and may only be used strictly
*   in accordance with the applicable license terms.  By expressly accepting
*   such terms or by downloading, installing, activating and/or otherwise using
*   the software, you are agreeing that you have read, and that you agree to
*   comply with and are bound by, such license terms.  If you do not agree to
*   be bound by the applicable license terms, then you may not retain,
*   install, activate or otherwise use the software.
==================================================================================================*/

/**
*   @file
*
*   @addtogroup adc_driver_config Adc Driver Configuration
*   @{
*/

#ifdef __cplusplus
extern "C"{
#endif

/*==================================================================================================
*                                        INCLUDE FILES
* 1) system and project includes
* 2) needed interfaces from external units
* 3) internal and external interfaces from this unit
==================================================================================================*/
#include "Adc_MBDT_PBcfg.h"
#include "Adc_Ipw_MBDT_PBcfg.h"

/*==================================================================================================
*                              SOURCE FILE VERSION INFORMATION
==================================================================================================*/

#define ADC_VENDOR_ID_MBDT_PBCFG_C                    43
#define ADC_AR_RELEASE_MAJOR_VERSION_MBDT_PBCFG_C     4
#define ADC_AR_RELEASE_MINOR_VERSION_MBDT_PBCFG_C     7
#define ADC_AR_RELEASE_REVISION_VERSION_MBDT_PBCFG_C  0
#define ADC_SW_MAJOR_VERSION_MBDT_PBCFG_C             5
#define ADC_SW_MINOR_VERSION_MBDT_PBCFG_C             0
#define ADC_SW_PATCH_VERSION_MBDT_PBCFG_C             0

/*==================================================================================================
*                                     FILE VERSION CHECKS
==================================================================================================*/

/* Check if Adc_MBDT_PBcfg.c file and Adc_MBDT_PBcfg.h file are of the same vendor */
#if (ADC_VENDOR_ID_MBDT_PBCFG_C != ADC_VENDOR_ID_MBDT_PBCFG)
    #error "Adc_MBDT_PBcfg.c and Adc_MBDT_PBcfg.h have different vendor ids"
#endif

/* Check if Adc_MBDT_PBcfg.c file and Adc_MBDT_PBcfg.h file are of the same Autosar version */
#if ((ADC_AR_RELEASE_MAJOR_VERSION_MBDT_PBCFG_C != ADC_AR_RELEASE_MAJOR_VERSION_MBDT_PBCFG) || \
     (ADC_AR_RELEASE_MINOR_VERSION_MBDT_PBCFG_C != ADC_AR_RELEASE_MINOR_VERSION_MBDT_PBCFG) || \
     (ADC_AR_RELEASE_REVISION_VERSION_MBDT_PBCFG_C != ADC_AR_RELEASE_REVISION_VERSION_MBDT_PBCFG) \
    )
    #error "AutoSar Version Numbers of Adc_MBDT_PBcfg.c and Adc_MBDT_PBcfg.h are different"
#endif

/* Check if Adc_MBDT_PBcfg.c file and Adc_MBDT_PBcfg.h file are of the same Software version */
#if ((ADC_SW_MAJOR_VERSION_MBDT_PBCFG_C != ADC_SW_MAJOR_VERSION_MBDT_PBCFG) || \
     (ADC_SW_MINOR_VERSION_MBDT_PBCFG_C != ADC_SW_MINOR_VERSION_MBDT_PBCFG) || \
     (ADC_SW_PATCH_VERSION_MBDT_PBCFG_C != ADC_SW_PATCH_VERSION_MBDT_PBCFG) \
    )
  #error "Software Version Numbers of Adc_MBDT_PBcfg.c and Adc_MBDT_PBcfg.h are different"
#endif

/* Check if Adc_MBDT_PBcfg.c file and Adc_Ipw_MBDT_PBcfg.h file are of the same vendor */
#if (ADC_VENDOR_ID_MBDT_PBCFG_C != ADC_IPW_VENDOR_ID_MBDT_PBCFG)
    #error "Adc_MBDT_PBcfg.c and Adc_Ipw_MBDT_PBcfg.h have different vendor ids"
#endif

/* Check if Adc_MBDT_PBcfg.c file and Adc_Ipw_MBDT_PBcfg.h file are of the same Autosar version */
#if ((ADC_AR_RELEASE_MAJOR_VERSION_MBDT_PBCFG_C != ADC_IPW_AR_RELEASE_MAJOR_VERSION_MBDT_PBCFG) || \
     (ADC_AR_RELEASE_MINOR_VERSION_MBDT_PBCFG_C != ADC_IPW_AR_RELEASE_MINOR_VERSION_MBDT_PBCFG) || \
     (ADC_AR_RELEASE_REVISION_VERSION_MBDT_PBCFG_C != ADC_IPW_AR_RELEASE_REVISION_VERSION_MBDT_PBCFG) \
    )
    #error "AutoSar Version Numbers of Adc_MBDT_PBcfg.c and Adc_Ipw_MBDT_PBcfg.h are different"
#endif

/* Check if Adc_MBDT_PBcfg.c file and Adc_Ipw_MBDT_PBcfg.h file are of the same Software version */
#if ((ADC_SW_MAJOR_VERSION_MBDT_PBCFG_C != ADC_IPW_SW_MAJOR_VERSION_MBDT_PBCFG) || \
     (ADC_SW_MINOR_VERSION_MBDT_PBCFG_C != ADC_IPW_SW_MINOR_VERSION_MBDT_PBCFG) || \
     (ADC_SW_PATCH_VERSION_MBDT_PBCFG_C != ADC_IPW_SW_PATCH_VERSION_MBDT_PBCFG) \
    )
  #error "Software Version Numbers of Adc_MBDT_PBcfg.c and Adc_Ipw_MBDT_PBcfg.h are different"
#endif

/*==================================================================================================
*                          LOCAL TYPEDEFS (STRUCTURES, UNIONS, ENUMS)
==================================================================================================*/

/*==================================================================================================
*                                      DEFINES AND MACROS
==================================================================================================*/

/*==================================================================================================
*                                       GLOBAL FUNCTIONS
==================================================================================================*/

/*==================================================================================================
*                                      LOCAL VARIABLES
==================================================================================================*/

/*==================================================================================================
*                                      GLOBAL VARIABLES
==================================================================================================*/

/*==================================================================================================
*                                      LOCAL CONSTANTS
==================================================================================================*/

#define ADC_START_SEC_CONFIG_DATA_UNSPECIFIED
#include "Adc_MemMap.h"

/**
* @brief          Group Assignments on ADC1 MBDT.
*
*/
static const Adc_ChannelType Adc_Group0_Assignment_1_MBDT[ADC_CFGSET_MBDT_GROUP_0_CHANNELS] =
{
    0U
};

/**
* @brief          Group Assignments on ADC1 MBDT.
*
*/
static const Adc_ChannelType Adc_Group2_Assignment_1_MBDT[ADC_CFGSET_MBDT_GROUP_2_CHANNELS] =
{
    0U
};

/**
* @brief          Group Assignments on ADC2 MBDT.
*
*/
static const Adc_ChannelType Adc_Group1_Assignment_2_MBDT[ADC_CFGSET_MBDT_GROUP_1_CHANNELS] =
{
    0U
};

/**
* @brief          Group Assignments on ADC2 MBDT.
*
*/
static const Adc_ChannelType Adc_Group3_Assignment_2_MBDT[ADC_CFGSET_MBDT_GROUP_3_CHANNELS] =
{
    0U
};

